ASC_CalculationAlgorithms/Catalogs/АСЦ_ВидыОперацийПлановоеНачислениеКВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>АСЦ_ВидыОперацийПлановоеНачислениеКВ</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДвиженияСумма</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСоотвествияВыгрузкаАстра</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СоответствиеВнешнимИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьКорректировки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФиксированнаяСебестоимость</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБУ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеЦФО</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.АСЦ_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтатьи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ASC_CalculationAlgorithms/Catalogs/АСЦ_ВидыОперацийПлановоеНачислениеКВ/Ext/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	СпрОбъект = КВБанков.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ОплатаВБанке.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ДопКВСтраховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("КВ банков");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ДиагностическаяКарта.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Истина;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = ПрямыеРасчетыССК.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "СуммаКВ";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.ОтражатьВБУ                = Ложь;
	СпрОбъект.Записать();
	
	СпрОбъект = Страховки.ПолучитьОбъект();
	СпрОбъект.ДвиженияСумма = "Сумма";
	СпрОбъект.НастройкаСоотвествияВыгрузкаАстра = Справочники.СоответствиеВнешнимИБ.НайтиПоНаименованию("Реализация ОФУ");
	СпрОбъект.ФиксированнаяСебестоимость = Ложь;
	СпрОбъект.ОтражатьВБУ                = Истина;
	СпрОбъект.ФормироватьКорректировки   = Истина;
	СпрОбъект.Записать();
	
КонецПроцедуры

Функция ПолучитьСтатьюПоЦФО(Ссылка, ЦФО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("ЦФО",    ЦФО);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Спр.Статья КАК Статья
	|ИЗ
	|	Справочник.АСЦ_ВидыОперацийПлановоеНачислениеКВ.ДоступныеЦФО КАК Спр
	|ГДЕ
	|	Спр.Ссылка = &Ссылка
	|	И Спр.ЦФО = &ЦФО";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.СтатьиДоходовИРасходов.ПустаяСсылка();
	Иначе	
	    Возврат Результат.Выгрузить()[0][0];
	КонецЕсли;	
	
КонецФункции
